#+BEGIN_COMMENT
.. title: On Algorithms
.. slug: on-algorithms
.. date: 2023-01-15 14:35:32 UTC+01:00
.. tags: Algorithms, software-engineering
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

So I am starting this post as always in order to keep structure and
leverage on it thorugh time.

The idea is essentially the same of the other post about classical
architectures - and the idea of Da Vinci. Have the map and then
leverage on it thorugh time.

I will also create a relevant post for the data structures. I studied
most of them and have made manual notes.

Also at some point when making leetcode exercises I improved quite a
bit on them. Make that post as you know how easy it is to foget things
and if you do not have a way to structure the way you work you will be
lost. 


{{{TEASER_END}}}


*** Counting Sort Algorithm

    I will work now with the counting sort algorithm. This is the one I
    need for performing an assignment.

    It is good cause when sorting it also keeps track of the
    occurrences of items. This is exactly what I need.

    So while there might be sorting algorithms that are faster for the
    particular application which is of a low-order /n/ this is quite
    satisfying as with it you kills two birds with one stone.

    #+begin_src java :results output drawer :classname CountingSort 
    import java.util.*;

    class CountingSort {

	static void countSort(int[] arr)  // Passing by referece. Work with it.
	{

	    int max = 14;
	    int min = 1;
	    int range = max - min + 1;  // plus 1 cause 0

	    int count[] = new int[range];
	    int output[] = new int[arr.length];

	    for (int i = 0; i < arr.length; i++) {
		count[arr[i] - min]++;
	    }

	    // So below you see - sum all of the occurrences up to the index.
	    for (int i = 1; i < count.length; i++) {
		count[i] += count[i - 1]; 
	    }

	    for (int i = arr.length - 1; i >= 0; i--) {    // -1 cause it starts at 0 the index.
		output[count[arr[i] - min] - 1] = arr[i];  // count [10 + 10] = sum counts until count [5] -1.
		count[arr[i] - min]--;                     // this is the reason why the above works.
	    }

	    printArray (count);	 // count reverse - subtract.

	    for (int i = 0; i < arr.length; i++) {
		arr[i] = output[i];
		// Simply copy the output
		// array. You could work by value
		// and not reference and return
		// the output array instead of
		// copying it.
	    }

	}

	static void printArray(int[] arr)
	{
	    for (int i = 0; i < arr.length; i++) {
		System.out.print(arr[i] + " ");
	    }
	    System.out.println("");
	}

	// Driver code
	public static void main(String[] args)
	{
	    //int[] arr = { -5, -10, 0, -3, 8, 5, -1, 10 };

	    int[] arr = { 10, 11, 14, 12, 13 };

	    // Function call
	    countSort(arr);
	    printArray(arr);
	}
    }
    #+end_src
    
     #+RESULTS:
     :results:
     0 0 0 0 0 0 0 0 0 0 1 2 3 4 
     10 11 12 13 14 
     :end:
    


